# список (list()) - изменяемый, индексируемый 
# кортеж (turple()) - неизменяемый, индексируемый 
# my_turple = (1, 2, 3, 4, 5,) my_turple2 = my_turple2([12421 421 421 421 4])- 2 пример создания кортежа
# множество (set()) изменяемый, не индексируемый  берет что угодно и выдает уникальный номер
# слоаварь (dict()) изменяемый,  не индексируемый, c уникальным ключем. обращаемся к ключу через [] скобки 
# my_dict_values() - возвращает значение,
# my_dict_keys() - возвращает ключи,
# my_dict.items() - возвращает ключи и обЬекты